Documents/АТ_ЭкспедиторскаяРасписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>АТ_ЭкспедиторскаяРасписка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АТ_ЭкспедиторскиеРасписки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРасписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументыСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаршрутноеЗадание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.МегаЛогист_МаршрутноеЗадание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/АТ_МаршрутныеЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>АТ_МаршрутныеЗадания</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МегаЛогист_СтатусыМаршрутногоЗадания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МаршрутноеЗадание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МегаЛогист_МаршрутноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/АТ_ЭкспедиторскиеРасписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>АТ_ЭкспедиторскиеРасписки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭкспедиторскаяРасписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АТ_ЭкспедиторскаяРасписка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МаршрутноеЗадание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МегаЛогист_МаршрутноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/АТ_СвязьОбъектовКП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>АТ_СвязьОбъектовКП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбновленыДействия</Name>
					<Comment>Если флана нет, тогда нужно обновить действия взаказе (этим займется робот) после чего установить этот флаг обработки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезультат</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/МегаЛогист_МаршрутноеЗадание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>МегаЛогист_МаршрутноеЗадание</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.МегаЛогист_МаршрутноеЗадание</xr:Item>
				<xr:Item>Document.ВозвратТоваровПоставщику</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АТ_МаршрутныеЗадания</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.МегаЛогист_МаршрутноеЗадание</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МегаЛогист_ТипыМаршрутныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКДоставке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МегаЛогист_СтатусыМаршрутногоЗадания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНевыполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МегаЛогист_ПричиныНевыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКПричине</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКурьера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АТ_ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АТ_Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТребованияКТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Требование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МегаЛогист_ТребованияКТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АТ_ЭкспедиторскаяРасписка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьФильтрКонтрагента();
	
КонецПроцедуры

#Область Пересчет

&НаКлиенте
Процедура РаскидатьСумму()
	
	Кол = Объект.Документы.Количество();
	
	Если Кол Тогда
	
		Для Каждого Строка Из Объект.Документы Цикл
			Строка.Сумма = Объект.Сумма / Кол;
		КонецЦикла;
		
		ПослСтрока = Объект.Документы[Кол - 1];
		ПослСтрока.Сумма = ПослСтрока.Сумма + Объект.Сумма - Объект.Документы.Итог("Сумма");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыСуммаПриИзменении(Элемент)
	
	Объект.Сумма = Объект.Документы.Итог("Сумма");
	
КонецПроцедуры
&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	РаскидатьСумму();
	
КонецПроцедуры

#КонецОбласти

#Область Фильтры_партнеров

&НаСервере
Функция СписокПартнеров(Кого, ПоКому)
	
	Запрос = Новый Запрос(СтрШаблон("
	|ВЫБРАТЬ 	РАЗЛИЧНЫЕ %1 Партнер 
	|ИЗ 		РегистрНакопления.АТ_МаршрутныеЗадания.Обороты(,,,%2 = &Ссылка)
	|", 
		Кого,
		ПоКому));
	
	Запрос.УстановитьПараметр("Ссылка", Объект[ПоКому]);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Партнер");
	
КонецФункции
&НаКлиенте
Процедура НачалоВыбораЭлемента(Кого, ПоКому, Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	ПарВыбора 				= Новый Структура;
	
	Если Не Объект[ПоКому].Пустая() Тогда
		
		Партнеры = СписокПартнеров(Кого, ПоКому);
		ПарВыбора.Вставить("Отбор", Новый Структура("Ссылка", Партнеры));
		
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Партнеры.ФормаВыбора", ПарВыбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачалоВыбораЭлемента("Партнер", "ТК", Элемент, СтандартнаяОбработка);
	
КонецПроцедуры
&НаКлиенте
Процедура ТКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачалоВыбораЭлемента("ТК", "Партнер", Элемент, СтандартнаяОбработка);
	
КонецПроцедуры
&НаКлиенте
Процедура ПриИзменении(Кого, ПоКому)
	
	Если Объект[ПоКому].Пустая() Тогда
		
		Партнеры = СписокПартнеров(ПоКому, Кого);
		Если Партнеры.Количество() = 1 Тогда
			Объект[ПоКому] = Партнеры[0];
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
	ПриИзменении("Партнер", "ТК");
	
	Контры = КонтрагентыПартнера();
	Если Контры.Количество() = 1 Тогда
		Объект.Контрагент = Контры[0];
	ИначеЕсли Контры.Найти(Объект.Контрагент) = Неопределено Тогда
		Объект.Контрагент = Неопределено;
	КонецЕсли;
	
	УстановитьФильтрКонтрагента();
	
КонецПроцедуры
&НаКлиенте
Процедура ТКПриИзменении(Элемент)
	
	ПриИзменении("ТК", "Партнер");
	
КонецПроцедуры


#КонецОбласти

#Область Контрагент

&НаСервере
Функция КонтрагентыПартнера()
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.Контрагенты ГДЕ Партнер = &Партнер");
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Процедура УстановитьФильтрКонтрагента()
	
	Массив = Новый Массив;
	
	Если Не Объект.Партнер.Пустая() Тогда
		
		Связь = Новый СвязьПараметраВыбора("Отбор.Партнер", "Объект.Партнер");
		Массив.Добавить(Связь);
		
	КонецЕсли;
	
	Элементы.Контрагент.СвязиПараметровВыбора = Новый ФиксированныйМассив(Массив);
	
КонецПроцедуры
&НаСервере
Процедура ОбновитьПартнера()
	
	Если Не Объект.Контрагент.Пустая() Тогда
		Объект.Партнер = Объект.Контрагент.Партнер;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ОбновитьПартнера();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьЗаполненныеДокументы()
	
	ДатаСКоторойВсеНачалось = '20180827'; // дата с которой начали вести расписки, до этого загружать нет смысла так как экспедиторские расписки не велись
	
	Запрос = Новый Запрос(СтрШаблон("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ Зад.Партнер, Зад.Документ, Зад.МаршрутноеЗадание
	|ИЗ РегистрНакопления.АТ_МаршрутныеЗадания Зад
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.АТ_ЭкспедиторскиеРасписки Расп
	|ПО
	|	Зад.ТК = Расп.ТК И
	|	Зад.Партнер = Расп.Партнер И
	|	Зад.Документ = Расп.Документ И
	|	Зад.МаршрутноеЗадание = Расп.МаршрутноеЗадание
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ 	РегистрСведений.АТ_СвязьОбъектовКП СвязьКП
	|ПО					Зад.Документ ССЫЛКА Документ.ПеремещениеТоваров И 
	|					Зад.Документ = СвязьКП.ДокументРезультат
	|
	|ГДЕ
	|	Расп.МаршрутноеЗадание ЕСТЬ NULL И
	|	Зад.ТК 		= &ТК И
	|	Зад.Партнер = &Партнер И
	|	Зад.МаршрутноеЗадание.Дата >= &Дата И
	|	НЕ Зад.МаршрутноеЗадание В(&Задания)
	|	%1
	|
	|УПОРЯДОЧИТЬ ПО Зад.Документ.Дата
	|", ?(Объект.Контрагент.Пустая(), "", "И ЕСТЬNULL(СвязьКП.КП.Контрагент, Зад.Документ.Контрагент) = &Контрагент")));
	
	Запрос.УстановитьПараметр("Дата", 		ДатаСКоторойВсеНачалось);
	Запрос.УстановитьПараметр("ТК", 		Объект.ТК);
	Запрос.УстановитьПараметр("Партнер", 	Объект.Партнер);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("Задания", 	Объект.Документы.Выгрузить(,"МаршрутноеЗадание").ВыгрузитьКолонку("МаршрутноеЗадание"));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Документы.Очистить();
	Объект.Документы.Загрузить(ПолучитьЗаполненныеДокументы());
	
КонецПроцедуры
&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	РаскидатьСумму();
	
КонецПроцедуры
&НаСервере
Процедура ДобавитьНаСервере()
	
	КонвертацияТипов.ДобавитьТаблицуКДругойТаблице(Объект.Документы, ПолучитьЗаполненныеДокументы());
	
КонецПроцедуры
&НаКлиенте
Процедура Добавить(Команда)
	
	ДобавитьНаСервере();
	РаскидатьСумму();
	
КонецПроцедуры


&НаСервере
Функция ПолучитьСписокМаршрЗаданий(ДокСсылка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Документ.МегаЛогист_МаршрутноеЗадание ГДЕ ДокументОснование = &Док");
	Запрос.УстановитьПараметр("Док", ДокСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
&НаСервере
Функция ПолучитьДокОснованиеЗадания(ЗадСсылка)
	
	Возврат ЗадСсылка.ДокументОснование;
	
КонецФункции
&НаКлиенте
Процедура ДокументыДокументПриИзменении(Элемент)
	
	текДанные = Элементы.Документы.ТекущиеДанные;
	Задания = ПолучитьСписокМаршрЗаданий(текДанные.Документ);
	
	Если Задания.Количество() = 1 Тогда
		текДанные.МаршрутноеЗадание = Задания[0];
	КонецЕсли;
	
	ОбновитьПартнераВТаблице(Объект.Документы.Индекс(текДанные));
	
КонецПроцедуры
&НаКлиенте
Процедура ДокументыМаршрутноеЗаданиеПриИзменении(Элемент)
	
	текДанные = Элементы.Документы.ТекущиеДанные;
	текДанные.Документ = ПолучитьДокОснованиеЗадания(текДанные.МаршрутноеЗадание);
	ОбновитьПартнераВТаблице(Объект.Документы.Индекс(текДанные));
	
КонецПроцедуры
&НаКлиенте
Процедура ДокументыМаршрутноеЗаданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	текДанные = Элементы.Документы.ТекущиеДанные;
	Если ЗначениеЗаполнено(текДанные.Документ) Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Документ.МегаЛогист_МаршрутноеЗадание.ФормаВыбора", Новый Структура("Отбор", Новый Структура("Ссылка", ПолучитьСписокМаршрЗаданий(текДанные.Документ))), Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПартнера(ДокСсылка)
	
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		Возврат Документы.КП.ПолучитьПартнераИЗДокументРезультат(ДокСсылка);
		
	Иначе
		
		Возврат ДокСсылка.Партнер;
		
	КонецЕсли;
	
КонецФункции
&НаСервере
Процедура ОбновитьПартнераВТаблице(Инд)
	
	текДанные = Объект.Документы[Инд];
	Если текДанные <> Неопределено И текДанные.Партнер.Пустая() И ЗначениеЗаполнено(текДанные.Документ) Тогда
		
		ПартнерДок = ПолучитьПартнера(текДанные.Документ);
		Если текДанные.Партнер <> ПартнерДок Тогда
			текДанные.Партнер = ПартнерДок;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
